export const questions = [

    // об'єкт запитання
    {
        qw: "Формула дискримінанту?",  // текст запитання
        ans: ["b2 - 4ac", "b2 + 4ac", "a - 4bc", "b² - 4ac"], // масив відповідей
        correct: "b² - 4ac",
        img:"johnstone.jpeg" // правильна відповідь
    },
    {
        qw: "5 - 2 = ?",
        ans: ["1", "3", "5", "7"],
        correct: "3"
    },
    {
        qw: "3 x 3 = ?",
        ans: ["6", "9", "12", "15"],
        correct: "9"
    },
    {
        qw: "Який результат виразу 45 + 18 = ?",
        ans: ["53", "73", "83", "63"],
        correct: "63"
    },
    {
        qw: "Розв'яжіть лінійне рівняння: 3x - 7 = 14.",
        ans: ["x = 5", "x = 21", "x = 3", "x = 7"],
        correct: "x = 7"
    },
    {
        qw: "Розв'яжіть вираз: 1/8 + 8/1",
        ans: ["8", "0", "-1", "1"],
        correct: "1"
    },
    {
        qw: "Обчисліть суму дробів: 1/4 + 1/2.",
        ans: ["1/6", "2/6", "4/4", "3/4"],
        correct: "3/4"
    },
    {
        qw: "Яке значення виразу 2^5 ?",
        ans: ["10", "16", "25", "32"],
        correct: "32"
    },
    {
        qw: "Обчисліть: 10 * (5 - 2) + 1.",
        ans: ["21", "13", "51", "31"],
        correct: "31"
    },
    {
        qw: "Який результат множення: -4 * 6 ?",
        ans: ["2", "24", "-2", "-24"],
        correct: "-24"
    },
    {
        qw: "Довжина прямокутника 8 м, а ширина 3 м. Знайдіть його периметр.",
        ans: ["11 м", "-22 м", "24 м", "22 м"],
        correct: "22 м"
    },
    {
        qw: "Які корені рівняння x^2 = 49$?",
        ans: ["x = 7", "x = -7", "x = 1", "x = 7 та x = -7"],
        correct: "x = 7 та x = -7"
    }
]